
window.onload = function() {
	Wencai.init();
}

let daily;
let Wencai = new __Wencai();
function __Wencai() {

	this.href = 'http://www.iwencai.com/unifiedwap/result?w=#word';
	this.texts = {
		YGJLR: '预告净利润',
		QTDS: '蜻蜓点水',
		WLFC: '卧龙凤雏',
		JJJ: '尖尖角',
		JJG: '节节高',
		JJR: '节假日',
		HTD: '华佗·日',
		HTW: '华佗·周',
		HTM: '华佗·月',
		HQB: '霍去病',
		XQJ: '辛弃疾',
		LSZ: '李时珍',
		ZJL: '周杰伦',
		BB: '病变',
	};

	this.init = function() {
		this.load();
		this.zoom();
		this.season();
		this.daily();
	}

	this.load = function() {
		this.outer = this.getElem('outer');
		this.inner = this.getElem('inner');
		this.table1 = this.getElem('table1');
		this.table2 = this.getElem('table2');
		this.table3 = this.getElem('table3');
		this.msgbox = this.getElem('msgbox');
		this.write = this.getElem('write');
		this.input = this.getElem('input');
		this.save = this.getElem('save');
		daily = JSON.parse(localStorage.getItem('daily')) || [];
	}

	this.season = function() {
		for (let i in seasonData) {
			let temp = seasonData[i];
			this.year = temp[1];
			temp.push(this.advanceStr(temp));
			let tr = this.creatElem('tr', table1, 'tr', temp[0]);
			for (let j=0; j<4; j++) {
				let td = this.creatElem('td', tr, 'td', temp[j]);
				td.setAttribute('type', 'normal');
				td.setAttribute('year', this.year);
				if (j == 0) {
					let date = this.creatElem('div', td, 'date');
					date.innerHTML  = temp[1] + '年' + temp[0];
					this.link(td, temp[6],'YGJLR');
				} else {
					let date = this.creatElem('div', td, 'date');
					date.innerHTML  = temp[1] + '年' + temp[j+2][0] + '月';
					this.link(td, temp[j+2][1],'QTDS');
					this.link(td, temp[j+2][2],'WLFC');
					this.link(td, temp[j+2][3],'JJJ');
				}
			}
		}
	}

	this.advanceStr = function(data) {
		return data[1] + data[0] + '预告净利润/' + data[1] + data[2] + '市值前20';
	}

	this.link = function(td, word, key) {
		let a = this.creatElem('a', td, key, td.idx);
		a.setAttribute('year', this.year);
		a.href = this.href.replace('#word', word);
		a.text = this.texts[key] || key;
		a.word = word;
		a.idx = td.idx;
		a.key = key;
		a.innerHTML = a.text + '(' + this.getDaily(a.idx, a.key, 1) + ')<br/>';
		let lastIdx = this.getDaily(0, 'lastIdx');
		let lastKey = this.getDaily(0, 'lastKey');
		if (a.idx == lastIdx && a.key == lastKey) {
			td.scrollIntoView(1);
			td.appendChild(this.save.parentNode);
			this.save.parentNode.style.display = 'block';
			this.save.onclick = function() {
				let array = Wencai.toArray(Wencai.input.value);
				Wencai.setDaily(lastIdx, lastKey, array);
				let a = Wencai.getElem(lastKey + '_' + lastIdx);
				a.innerHTML = Wencai.texts[key]+ '(' + Wencai.getDaily(a.idx, a.key, 1) + ')<br/>';
				Wencai.save.parentNode.style.display = 'none';
			}
		}
		if (this.isPhone)
			return;
		a.onmouseup = function(e) {
			Wencai.setDaily(0, 'lastIdx', this.idx);
			Wencai.setDaily(0, 'lastKey', this.key);
			Wencai.input.value = '';
		}

		a.onmouseover = function() {
			Wencai.msgbox.innerHTML = Wencai.getDaily(this.idx, 'date') + ' ' + this.text;
			let array = Wencai.getDaily(this.idx, this.key);
			if (JSON.stringify(array).length < 10) array = [['空']];
			for (let i in array) {
				let tr = Wencai.creatElem('tr', Wencai.table3, this.key);
				for (let j in array[i]) {
					let td = Wencai.creatElem('td', tr, 'td');
					td.setAttribute('type', 'mini');
					td.innerHTML = array[i][j];
				}
			}
		}
		a.onmouseout = function() {
			Wencai.msgbox.innerHTML = '';
			Wencai.table3.innerHTML = '';
		}
	}

	this.daily = function() {
		this.data = [];
		let list = dailyData.split('\n');
		let tr = this.creatElem('tr', table2, 'tr');
		for (let i in list) {
			let temp = this.split(list[i]);
			this.year = temp[1];
			if (!temp[1])
				continue;
			if (temp[6] == 1)
				tr = this.creatElem('tr', table2, 'tr', temp[1]);
			let td = this.creatElem('td', tr, 'td', temp[0]);
			td.setAttribute('type', 'normal');
			td.setAttribute('year', this.year);
			let date = this.creatElem('div', td, 'date');
			date.innerHTML = temp[0];
			td.idx = i;
			if (temp[16]) {
				this.link(td, temp[16], temp[16]);
				continue;
			}
			temp.push(this.huatuoDayStr(temp));
			temp.push(this.huatuoWeekStr(temp));
			temp.push(this.huatuoMonthStr(temp));
			temp.push(this.xinqijiDayStr(temp));
			temp.push(this.huoqubingDayStr(temp));
			temp.push(this.zhoujielunDayStr(temp));
			this.link(td, temp[17],'HTD');
			this.link(td, temp[18],'HTW');
			this.link(td, temp[19],'HTM');
			this.link(td, temp[20],'XQJ');
			this.link(td, temp[21],'HQB');
			this.link(td, temp[22],'ZJL');
			// this.setDaily(i, 'date', temp[1] + '年'+ temp[0]);
			if (temp[6] == 1) {
				temp.push(this.lishizhenWeekStr(temp));
				this.link(td, temp[23],'LSZ');
			}
			if (temp[6] == 5) {
				temp.push(this.sickWeekStr(temp));
				this.link(td, temp[23],'BB');
			}
			this.data[i] = temp;
		}
		console.log(this.data);
	}

	this.split = function(str) {
		let data = str.split(',');
		data[1] = ~~data[1];
		data[6] = ~~data[6];
		data[11] = ~~data[11];
		for (let i=12; i<16; i++) {
			if (~~data[i] > data[11])
				data[i] = data[1]-1 + '年' + data[i] + '月';
			else
				data[i] = data[1] + '年' + data[i] + '月';
		}
		return data;
	}


	this.huatuoDayStr = function(data) {
		return data[0] + word[0] + 
		data[5] + word[1] + 
		data[5] + word[3] + data[3] + word[5] + 
		data[5] + word[3] + data[4] + word[5] + 
		data[5] + word[3] + data[2] + word[5] + 
		data[5] + word[4] + data[0] + word[5]; 
	}

	this.huatuoWeekStr = function(data) {
		return data[0] + word[0] + 
		data[10] + word[2] + 
		data[10] + word[3] + data[8] + word[5] + 
		data[10] + word[3] + data[9] + word[5] + 
		data[10] + word[3] + data[2] + word[5] + 
		data[10] + word[4] + data[0] + word[5]; 
	}

	this.huatuoMonthStr = function(data) {
		return data[0] + word[0] + 
		data[15] + word[1] + 
		data[15] + word[3] + data[13] + word[5] + 
		data[15] + word[3] + data[14] + word[5] + 
		data[15] + word[3] + data[2] + word[5] + 
		data[15] + word[4] + data[0] + word[5]; 
	}

	this.zhoujielunDayStr = function(data) {
		return data[0] + word[18] + 
		data[2] + word[19] + data[2] + word[20] +  
		data[2] + word[21];  
	}


	this.sickDayStr = function(data) {
		return data[0] + word[8] + data[0] + word[9] + 
		data[0] + word[6];
	}

	this.sickWeekStr = function(data) {
		return data[0] + word[10] + data[0] + word[11] + 
		data[0] + word[6];
	}

	this.lishizhenWeekStr = function(data) {
		return data[8] + word[10] + data[8] + word[11] + 
		data[8] + word[6] + 
		data[0] + word[7] + 
		data[0] + word[12] + data[8] + word[13];
	}

	this.xinqijiDayStr = function(data) {
		return data[0] + word[0] +  
		data[2] + word[14] + data[2] + word[15];
	}

	this.huoqubingDayStr = function(data) {
		return data[0] + word[0] +  
		data[0] + word[16] + data[0] + word[17];
	}

	this.toArray = function(str) {
		if (str.length<=10) return str;
		str = str.replace(/(?<=[^0-9 ]) /g, ',');
		let array = str.split(',');
		for (let i in array) {
			array[i] = array[i].split(' ');
		}
		return array;
	}

	this.getDaily = function(idx, key, islen) {
    	daily[idx] = daily[idx] || {};
    	let val = daily[idx][key];
    	if (typeof(val) === 'object' && islen)
    		return val.length;
    	else
			return val || '-';
	}

	this.setDaily = function(idx, key, val) {
    	daily[idx] = daily[idx] || {};
    	daily[idx][key] = val;
    	localStorage.setItem('daily', JSON.stringify(daily));
	}

	this.creatElem = function(type, parent, className, id) {
	    var e = document.createElement(type);
	    if (parent)
	        parent.appendChild(e);
	    if (className)
	        e.className = className;
	    if (id != null)
	        e.id = className + '_' + id;
	    return e;
	}

	this.getElem = function (e) {
	    if (typeof(e) === 'string')
	        return this.getElem(document.getElementById(e));
	    if (e &&  e.style)
	        return e;
	    return null;
	}

	this.zoom = function(z) {
    	this.isPhone = (/Android|webOS|iPhone|iPod|BlackBerry|Mobile|MIX/i.test(navigator.userAgent));
    	if (z) {
    		this.setDaily(0, 'zoom', z);
			document.body.style.zoom = z;
    	} else {
    		document.body.style.zoom = this.getDaily(0, 'zoom');
    	}
	}
}

let seasonData = [
	['一季度', 2021, '3月31日', [1],[2],[3]],
	['二季度', 2021, '6月30日', [4],[5],[6]],
	['三季度', 2021, '9月30日', [7],[8],[9]],
	['四季度', 2021, '12月31日', [10],[11],[12]],
	['一季度', 2022, '3月31日', [1],[2],[3]],
	['二季度', 2022, '6月30日', [4],[5],[6]],
	['三季度', 2022, '9月30日', [7],[8],[9]],
	['四季度', 2022, '12月31日', [10],[11],[12]],
];

let word = [
	'涨停,换手率小于15,主板非st,',
	'的涨跌幅大于0,',
	'的周涨跌幅大于0,',
	'的收盘价大于',
	'的收盘价小于',
	'的收盘价,',
	'至今涨跌幅,主板非st,',
	'开盘涨跌幅大于5,',
	'的20日均线大于10日均线大于30日均线,',
	'的30日均线大于5日均线大于60日均线,',
	'的20周均线大于10周均线大于30周均线,',
	'的30周均线大于5周均线大于60周均线,',
	'的开盘价/',
	'的收盘价大于1.2,',
	'的20日均线大于10日均线大于5日均线,',
	'的20日均线大于30日均线大于60日均线,',
	'的20日均线小于10日均线小于5日均线,',
	'的20日均线小于30日均线小于60日均线,',
	'的涨停,主板非st,',
	'开盘价>5日均线>收盘价,',
	'开盘价>10日均线>收盘价,',
	'收盘价>20日均线>30日均线>60日均线,',
];

let dailyData =`
1月4日,2021,1月1日,12月31日,12月30日,12月29日,1,1月1日,12月25日,12月18日,12月11日,1,12,11,10,9,
1月5日,2021,1月4日,1月1日,12月31日,12月30日,2,1月1日,12月25日,12月18日,12月11日,1,12,11,10,9,
1月6日,2021,1月5日,1月4日,1月1日,12月31日,3,1月1日,12月25日,12月18日,12月11日,1,12,11,10,9,
1月7日,2021,1月6日,1月5日,1月4日,1月1日,4,1月1日,12月25日,12月18日,12月11日,1,12,11,10,9,
1月8日,2021,1月7日,1月6日,1月5日,1月4日,5,1月1日,12月25日,12月18日,12月11日,1,12,11,10,9,
1月11日,2021,1月8日,1月7日,1月6日,1月5日,1,1月8日,1月1日,12月25日,12月18日,1,12,11,10,9,
1月12日,2021,1月11日,1月8日,1月7日,1月6日,2,1月8日,1月1日,12月25日,12月18日,1,12,11,10,9,
1月13日,2021,1月12日,1月11日,1月8日,1月7日,3,1月8日,1月1日,12月25日,12月18日,1,12,11,10,9,
1月14日,2021,1月13日,1月12日,1月11日,1月8日,4,1月8日,1月1日,12月25日,12月18日,1,12,11,10,9,
1月15日,2021,1月14日,1月13日,1月12日,1月11日,5,1月8日,1月1日,12月25日,12月18日,1,12,11,10,9,
1月18日,2021,1月15日,1月14日,1月13日,1月12日,1,1月15日,1月8日,1月1日,12月25日,1,12,11,10,9,
1月19日,2021,1月18日,1月15日,1月14日,1月13日,2,1月15日,1月8日,1月1日,12月25日,1,12,11,10,9,
1月20日,2021,1月19日,1月18日,1月15日,1月14日,3,1月15日,1月8日,1月1日,12月25日,1,12,11,10,9,
1月21日,2021,1月20日,1月19日,1月18日,1月15日,4,1月15日,1月8日,1月1日,12月25日,1,12,11,10,9,
1月22日,2021,1月21日,1月20日,1月19日,1月18日,5,1月15日,1月8日,1月1日,12月25日,1,12,11,10,9,
1月25日,2021,1月22日,1月21日,1月20日,1月19日,1,1月22日,1月15日,1月8日,1月1日,1,12,11,10,9,
1月26日,2021,1月25日,1月22日,1月21日,1月20日,2,1月22日,1月15日,1月8日,1月1日,1,12,11,10,9,
1月27日,2021,1月26日,1月25日,1月22日,1月21日,3,1月22日,1月15日,1月8日,1月1日,1,12,11,10,9,
1月28日,2021,1月27日,1月26日,1月25日,1月22日,4,1月22日,1月15日,1月8日,1月1日,1,12,11,10,9,
1月29日,2021,1月28日,1月27日,1月26日,1月25日,5,1月22日,1月15日,1月8日,1月1日,1,12,11,10,9,
2月1日,2021,1月29日,1月28日,1月27日,1月26日,1,1月29日,1月22日,1月15日,1月8日,2,1,12,11,10,
2月2日,2021,2月1日,1月29日,1月28日,1月27日,2,1月29日,1月22日,1月15日,1月8日,2,1,12,11,10,
2月3日,2021,2月2日,2月1日,1月29日,1月28日,3,1月29日,1月22日,1月15日,1月8日,2,1,12,11,10,
2月4日,2021,2月3日,2月2日,2月1日,1月29日,4,1月29日,1月22日,1月15日,1月8日,2,1,12,11,10,
2月5日,2021,2月4日,2月3日,2月2日,2月1日,5,1月29日,1月22日,1月15日,1月8日,2,1,12,11,10,
2月8日,2021,2月5日,2月4日,2月3日,2月2日,1,2月5日,1月29日,1月22日,1月15日,2,1,12,11,10,
2月9日,2021,2月8日,2月5日,2月4日,2月3日,2,2月5日,1月29日,1月22日,1月15日,2,1,12,11,10,
2月10日,2021,2月9日,2月8日,2月5日,2月4日,3,2月5日,1月29日,1月22日,1月15日,2,1,12,11,10,春节
2月11日,2021,2月10日,2月9日,2月8日,2月5日,4,2月5日,1月29日,1月22日,1月15日,2,1,12,11,10,春节
2月12日,2021,2月11日,2月10日,2月9日,2月8日,5,2月5日,1月29日,1月22日,1月15日,2,1,12,11,10,春节
2月15日,2021,2月12日,2月11日,2月10日,2月9日,1,2月12日,2月5日,1月29日,1月22日,2,1,12,11,10,春节
2月16日,2021,2月15日,2月12日,2月11日,2月10日,2,2月12日,2月5日,1月29日,1月22日,2,1,12,11,10,春节
2月17日,2021,2月16日,2月15日,2月12日,2月11日,3,2月12日,2月5日,1月29日,1月22日,2,1,12,11,10,春节
2月18日,2021,2月17日,2月16日,2月15日,2月12日,4,2月12日,2月5日,1月29日,1月22日,2,1,12,11,10,春节
2月19日,2021,2月18日,2月17日,2月16日,2月15日,5,2月12日,2月5日,1月29日,1月22日,2,1,12,11,10,
2月22日,2021,2月19日,2月18日,2月17日,2月16日,1,2月19日,2月12日,2月5日,1月29日,2,1,12,11,10,
2月23日,2021,2月22日,2月19日,2月18日,2月17日,2,2月19日,2月12日,2月5日,1月29日,2,1,12,11,10,
2月24日,2021,2月23日,2月22日,2月19日,2月18日,3,2月19日,2月12日,2月5日,1月29日,2,1,12,11,10,
2月25日,2021,2月24日,2月23日,2月22日,2月19日,4,2月19日,2月12日,2月5日,1月29日,2,1,12,11,10,
2月26日,2021,2月25日,2月24日,2月23日,2月22日,5,2月19日,2月12日,2月5日,1月29日,2,1,12,11,10,
3月1日,2021,2月26日,2月25日,2月24日,2月23日,1,2月26日,2月19日,2月12日,2月5日,3,2,1,12,11,
3月2日,2021,3月1日,2月26日,2月25日,2月24日,2,2月26日,2月19日,2月12日,2月5日,3,2,1,12,11,
3月3日,2021,3月2日,3月1日,2月26日,2月25日,3,2月26日,2月19日,2月12日,2月5日,3,2,1,12,11,
3月4日,2021,3月3日,3月2日,3月1日,2月26日,4,2月26日,2月19日,2月12日,2月5日,3,2,1,12,11,
3月5日,2021,3月4日,3月3日,3月2日,3月1日,5,2月26日,2月19日,2月12日,2月5日,3,2,1,12,11,
3月8日,2021,3月5日,3月4日,3月3日,3月2日,1,3月5日,2月26日,2月19日,2月12日,3,2,1,12,11,
3月9日,2021,3月8日,3月5日,3月4日,3月3日,2,3月5日,2月26日,2月19日,2月12日,3,2,1,12,11,
3月10日,2021,3月9日,3月8日,3月5日,3月4日,3,3月5日,2月26日,2月19日,2月12日,3,2,1,12,11,
3月11日,2021,3月10日,3月9日,3月8日,3月5日,4,3月5日,2月26日,2月19日,2月12日,3,2,1,12,11,
3月12日,2021,3月11日,3月10日,3月9日,3月8日,5,3月5日,2月26日,2月19日,2月12日,3,2,1,12,11,
3月15日,2021,3月12日,3月11日,3月10日,3月9日,1,3月12日,3月5日,2月26日,2月19日,3,2,1,12,11,
3月16日,2021,3月15日,3月12日,3月11日,3月10日,2,3月12日,3月5日,2月26日,2月19日,3,2,1,12,11,
3月17日,2021,3月16日,3月15日,3月12日,3月11日,3,3月12日,3月5日,2月26日,2月19日,3,2,1,12,11,
3月18日,2021,3月17日,3月16日,3月15日,3月12日,4,3月12日,3月5日,2月26日,2月19日,3,2,1,12,11,
3月19日,2021,3月18日,3月17日,3月16日,3月15日,5,3月12日,3月5日,2月26日,2月19日,3,2,1,12,11,
3月22日,2021,3月19日,3月18日,3月17日,3月16日,1,3月19日,3月12日,3月5日,2月26日,3,2,1,12,11,
3月23日,2021,3月22日,3月19日,3月18日,3月17日,2,3月19日,3月12日,3月5日,2月26日,3,2,1,12,11,
3月24日,2021,3月23日,3月22日,3月19日,3月18日,3,3月19日,3月12日,3月5日,2月26日,3,2,1,12,11,
3月25日,2021,3月24日,3月23日,3月22日,3月19日,4,3月19日,3月12日,3月5日,2月26日,3,2,1,12,11,
3月26日,2021,3月25日,3月24日,3月23日,3月22日,5,3月19日,3月12日,3月5日,2月26日,3,2,1,12,11,
3月29日,2021,3月26日,3月25日,3月24日,3月23日,1,3月26日,3月19日,3月12日,3月5日,3,2,1,12,11,
3月30日,2021,3月29日,3月26日,3月25日,3月24日,2,3月26日,3月19日,3月12日,3月5日,3,2,1,12,11,
3月31日,2021,3月30日,3月29日,3月26日,3月25日,3,3月26日,3月19日,3月12日,3月5日,3,2,1,12,11,
4月1日,2021,3月31日,3月30日,3月29日,3月26日,4,3月26日,3月19日,3月12日,3月5日,4,3,2,1,12,
4月2日,2021,4月1日,3月31日,3月30日,3月29日,5,3月26日,3月19日,3月12日,3月5日,4,3,2,1,12,
4月5日,2021,4月2日,4月1日,3月31日,3月30日,1,4月2日,3月26日,3月19日,3月12日,4,3,2,1,12,清明节
4月6日,2021,4月5日,4月2日,4月1日,3月31日,2,4月2日,3月26日,3月19日,3月12日,4,3,2,1,12,
4月7日,2021,4月6日,4月5日,4月2日,4月1日,3,4月2日,3月26日,3月19日,3月12日,4,3,2,1,12,
4月8日,2021,4月7日,4月6日,4月5日,4月2日,4,4月2日,3月26日,3月19日,3月12日,4,3,2,1,12,
4月9日,2021,4月8日,4月7日,4月6日,4月5日,5,4月2日,3月26日,3月19日,3月12日,4,3,2,1,12,
4月12日,2021,4月9日,4月8日,4月7日,4月6日,1,4月9日,4月2日,3月26日,3月19日,4,3,2,1,12,
4月13日,2021,4月12日,4月9日,4月8日,4月7日,2,4月9日,4月2日,3月26日,3月19日,4,3,2,1,12,
4月14日,2021,4月13日,4月12日,4月9日,4月8日,3,4月9日,4月2日,3月26日,3月19日,4,3,2,1,12,
4月15日,2021,4月14日,4月13日,4月12日,4月9日,4,4月9日,4月2日,3月26日,3月19日,4,3,2,1,12,
4月16日,2021,4月15日,4月14日,4月13日,4月12日,5,4月9日,4月2日,3月26日,3月19日,4,3,2,1,12,
4月19日,2021,4月16日,4月15日,4月14日,4月13日,1,4月16日,4月9日,4月2日,3月26日,4,3,2,1,12,
4月20日,2021,4月19日,4月16日,4月15日,4月14日,2,4月16日,4月9日,4月2日,3月26日,4,3,2,1,12,
4月21日,2021,4月20日,4月19日,4月16日,4月15日,3,4月16日,4月9日,4月2日,3月26日,4,3,2,1,12,
4月22日,2021,4月21日,4月20日,4月19日,4月16日,4,4月16日,4月9日,4月2日,3月26日,4,3,2,1,12,
4月23日,2021,4月22日,4月21日,4月20日,4月19日,5,4月16日,4月9日,4月2日,3月26日,4,3,2,1,12,
4月26日,2021,4月23日,4月22日,4月21日,4月20日,1,4月23日,4月16日,4月9日,4月2日,4,3,2,1,12,
4月27日,2021,4月26日,4月23日,4月22日,4月21日,2,4月23日,4月16日,4月9日,4月2日,4,3,2,1,12,
4月28日,2021,4月27日,4月26日,4月23日,4月22日,3,4月23日,4月16日,4月9日,4月2日,4,3,2,1,12,
4月29日,2021,4月28日,4月27日,4月26日,4月23日,4,4月23日,4月16日,4月9日,4月2日,4,3,2,1,12,
4月30日,2021,4月29日,4月28日,4月27日,4月26日,5,4月23日,4月16日,4月9日,4月2日,4,3,2,1,12,
5月3日,2021,4月30日,4月29日,4月28日,4月27日,1,4月30日,4月23日,4月16日,4月9日,5,4,3,2,1,劳动节
5月4日,2021,5月3日,4月30日,4月29日,4月28日,2,4月30日,4月23日,4月16日,4月9日,5,4,3,2,1,劳动节
5月5日,2021,5月4日,5月3日,4月30日,4月29日,3,4月30日,4月23日,4月16日,4月9日,5,4,3,2,1,劳动节
5月6日,2021,5月5日,5月4日,5月3日,4月30日,4,4月30日,4月23日,4月16日,4月9日,5,4,3,2,1,
5月7日,2021,5月6日,5月5日,5月4日,5月3日,5,4月30日,4月23日,4月16日,4月9日,5,4,3,2,1,
5月10日,2021,5月7日,5月6日,5月5日,5月4日,1,5月7日,4月30日,4月23日,4月16日,5,4,3,2,1,
5月11日,2021,5月10日,5月7日,5月6日,5月5日,2,5月7日,4月30日,4月23日,4月16日,5,4,3,2,1,
5月12日,2021,5月11日,5月10日,5月7日,5月6日,3,5月7日,4月30日,4月23日,4月16日,5,4,3,2,1,
5月13日,2021,5月12日,5月11日,5月10日,5月7日,4,5月7日,4月30日,4月23日,4月16日,5,4,3,2,1,
5月14日,2021,5月13日,5月12日,5月11日,5月10日,5,5月7日,4月30日,4月23日,4月16日,5,4,3,2,1,
5月17日,2021,5月14日,5月13日,5月12日,5月11日,1,5月14日,5月7日,4月30日,4月23日,5,4,3,2,1,
5月18日,2021,5月17日,5月14日,5月13日,5月12日,2,5月14日,5月7日,4月30日,4月23日,5,4,3,2,1,
5月19日,2021,5月18日,5月17日,5月14日,5月13日,3,5月14日,5月7日,4月30日,4月23日,5,4,3,2,1,
5月20日,2021,5月19日,5月18日,5月17日,5月14日,4,5月14日,5月7日,4月30日,4月23日,5,4,3,2,1,
5月21日,2021,5月20日,5月19日,5月18日,5月17日,5,5月14日,5月7日,4月30日,4月23日,5,4,3,2,1,
5月24日,2021,5月21日,5月20日,5月19日,5月18日,1,5月21日,5月14日,5月7日,4月30日,5,4,3,2,1,
5月25日,2021,5月24日,5月21日,5月20日,5月19日,2,5月21日,5月14日,5月7日,4月30日,5,4,3,2,1,
5月26日,2021,5月25日,5月24日,5月21日,5月20日,3,5月21日,5月14日,5月7日,4月30日,5,4,3,2,1,
5月27日,2021,5月26日,5月25日,5月24日,5月21日,4,5月21日,5月14日,5月7日,4月30日,5,4,3,2,1,
5月28日,2021,5月27日,5月26日,5月25日,5月24日,5,5月21日,5月14日,5月7日,4月30日,5,4,3,2,1,
5月31日,2021,5月28日,5月27日,5月26日,5月25日,1,5月28日,5月21日,5月14日,5月7日,5,4,3,2,1,
6月1日,2021,5月31日,5月28日,5月27日,5月26日,2,5月28日,5月21日,5月14日,5月7日,6,5,4,3,2,
6月2日,2021,6月1日,5月31日,5月28日,5月27日,3,5月28日,5月21日,5月14日,5月7日,6,5,4,3,2,
6月3日,2021,6月2日,6月1日,5月31日,5月28日,4,5月28日,5月21日,5月14日,5月7日,6,5,4,3,2,
6月4日,2021,6月3日,6月2日,6月1日,5月31日,5,5月28日,5月21日,5月14日,5月7日,6,5,4,3,2,
6月7日,2021,6月4日,6月3日,6月2日,6月1日,1,6月4日,5月28日,5月21日,5月14日,6,5,4,3,2,
6月8日,2021,6月7日,6月4日,6月3日,6月2日,2,6月4日,5月28日,5月21日,5月14日,6,5,4,3,2,
6月9日,2021,6月8日,6月7日,6月4日,6月3日,3,6月4日,5月28日,5月21日,5月14日,6,5,4,3,2,
6月10日,2021,6月9日,6月8日,6月7日,6月4日,4,6月4日,5月28日,5月21日,5月14日,6,5,4,3,2,
6月11日,2021,6月10日,6月9日,6月8日,6月7日,5,6月4日,5月28日,5月21日,5月14日,6,5,4,3,2,
6月14日,2021,6月11日,6月10日,6月9日,6月8日,1,6月11日,6月4日,5月28日,5月21日,6,5,4,3,2,端午节
6月15日,2021,6月14日,6月11日,6月10日,6月9日,2,6月11日,6月4日,5月28日,5月21日,6,5,4,3,2,
6月16日,2021,6月15日,6月14日,6月11日,6月10日,3,6月11日,6月4日,5月28日,5月21日,6,5,4,3,2,
6月17日,2021,6月16日,6月15日,6月14日,6月11日,4,6月11日,6月4日,5月28日,5月21日,6,5,4,3,2,
6月18日,2021,6月17日,6月16日,6月15日,6月14日,5,6月11日,6月4日,5月28日,5月21日,6,5,4,3,2,
6月21日,2021,6月18日,6月17日,6月16日,6月15日,1,6月18日,6月11日,6月4日,5月28日,6,5,4,3,2,
6月22日,2021,6月21日,6月18日,6月17日,6月16日,2,6月18日,6月11日,6月4日,5月28日,6,5,4,3,2,
6月23日,2021,6月22日,6月21日,6月18日,6月17日,3,6月18日,6月11日,6月4日,5月28日,6,5,4,3,2,
6月24日,2021,6月23日,6月22日,6月21日,6月18日,4,6月18日,6月11日,6月4日,5月28日,6,5,4,3,2,
6月25日,2021,6月24日,6月23日,6月22日,6月21日,5,6月18日,6月11日,6月4日,5月28日,6,5,4,3,2,
6月28日,2021,6月25日,6月24日,6月23日,6月22日,1,6月25日,6月18日,6月11日,6月4日,6,5,4,3,2,
6月29日,2021,6月28日,6月25日,6月24日,6月23日,2,6月25日,6月18日,6月11日,6月4日,6,5,4,3,2,
6月30日,2021,6月29日,6月28日,6月25日,6月24日,3,6月25日,6月18日,6月11日,6月4日,6,5,4,3,2,
7月1日,2021,6月30日,6月29日,6月28日,6月25日,4,6月25日,6月18日,6月11日,6月4日,7,6,5,4,3,
7月2日,2021,7月1日,6月30日,6月29日,6月28日,5,6月25日,6月18日,6月11日,6月4日,7,6,5,4,3,
7月5日,2021,7月2日,7月1日,6月30日,6月29日,1,7月2日,6月25日,6月18日,6月11日,7,6,5,4,3,
7月6日,2021,7月5日,7月2日,7月1日,6月30日,2,7月2日,6月25日,6月18日,6月11日,7,6,5,4,3,
7月7日,2021,7月6日,7月5日,7月2日,7月1日,3,7月2日,6月25日,6月18日,6月11日,7,6,5,4,3,
7月8日,2021,7月7日,7月6日,7月5日,7月2日,4,7月2日,6月25日,6月18日,6月11日,7,6,5,4,3,
7月9日,2021,7月8日,7月7日,7月6日,7月5日,5,7月2日,6月25日,6月18日,6月11日,7,6,5,4,3,
7月12日,2021,7月9日,7月8日,7月7日,7月6日,1,7月9日,7月2日,6月25日,6月18日,7,6,5,4,3,
7月13日,2021,7月12日,7月9日,7月8日,7月7日,2,7月9日,7月2日,6月25日,6月18日,7,6,5,4,3,
7月14日,2021,7月13日,7月12日,7月9日,7月8日,3,7月9日,7月2日,6月25日,6月18日,7,6,5,4,3,
7月15日,2021,7月14日,7月13日,7月12日,7月9日,4,7月9日,7月2日,6月25日,6月18日,7,6,5,4,3,
7月16日,2021,7月15日,7月14日,7月13日,7月12日,5,7月9日,7月2日,6月25日,6月18日,7,6,5,4,3,
7月19日,2021,7月16日,7月15日,7月14日,7月13日,1,7月16日,7月9日,7月2日,6月25日,7,6,5,4,3,
7月20日,2021,7月19日,7月16日,7月15日,7月14日,2,7月16日,7月9日,7月2日,6月25日,7,6,5,4,3,
7月21日,2021,7月20日,7月19日,7月16日,7月15日,3,7月16日,7月9日,7月2日,6月25日,7,6,5,4,3,
7月22日,2021,7月21日,7月20日,7月19日,7月16日,4,7月16日,7月9日,7月2日,6月25日,7,6,5,4,3,
7月23日,2021,7月22日,7月21日,7月20日,7月19日,5,7月16日,7月9日,7月2日,6月25日,7,6,5,4,3,
7月26日,2021,7月23日,7月22日,7月21日,7月20日,1,7月23日,7月16日,7月9日,7月2日,7,6,5,4,3,
7月27日,2021,7月26日,7月23日,7月22日,7月21日,2,7月23日,7月16日,7月9日,7月2日,7,6,5,4,3,
7月28日,2021,7月27日,7月26日,7月23日,7月22日,3,7月23日,7月16日,7月9日,7月2日,7,6,5,4,3,
7月29日,2021,7月28日,7月27日,7月26日,7月23日,4,7月23日,7月16日,7月9日,7月2日,7,6,5,4,3,
7月30日,2021,7月29日,7月28日,7月27日,7月26日,5,7月23日,7月16日,7月9日,7月2日,7,6,5,4,3,
8月2日,2021,7月30日,7月29日,7月28日,7月27日,1,7月30日,7月23日,7月16日,7月9日,8,7,6,5,4,
8月3日,2021,8月2日,7月30日,7月29日,7月28日,2,7月30日,7月23日,7月16日,7月9日,8,7,6,5,4,
8月4日,2021,8月3日,8月2日,7月30日,7月29日,3,7月30日,7月23日,7月16日,7月9日,8,7,6,5,4,
8月5日,2021,8月4日,8月3日,8月2日,7月30日,4,7月30日,7月23日,7月16日,7月9日,8,7,6,5,4,
8月6日,2021,8月5日,8月4日,8月3日,8月2日,5,7月30日,7月23日,7月16日,7月9日,8,7,6,5,4,
8月9日,2021,8月6日,8月5日,8月4日,8月3日,1,8月6日,7月30日,7月23日,7月16日,8,7,6,5,4,
8月10日,2021,8月9日,8月6日,8月5日,8月4日,2,8月6日,7月30日,7月23日,7月16日,8,7,6,5,4,
8月11日,2021,8月10日,8月9日,8月6日,8月5日,3,8月6日,7月30日,7月23日,7月16日,8,7,6,5,4,
8月12日,2021,8月11日,8月10日,8月9日,8月6日,4,8月6日,7月30日,7月23日,7月16日,8,7,6,5,4,
8月13日,2021,8月12日,8月11日,8月10日,8月9日,5,8月6日,7月30日,7月23日,7月16日,8,7,6,5,4,
8月16日,2021,8月13日,8月12日,8月11日,8月10日,1,8月13日,8月6日,7月30日,7月23日,8,7,6,5,4,
8月17日,2021,8月16日,8月13日,8月12日,8月11日,2,8月13日,8月6日,7月30日,7月23日,8,7,6,5,4,
8月18日,2021,8月17日,8月16日,8月13日,8月12日,3,8月13日,8月6日,7月30日,7月23日,8,7,6,5,4,
8月19日,2021,8月18日,8月17日,8月16日,8月13日,4,8月13日,8月6日,7月30日,7月23日,8,7,6,5,4,
8月20日,2021,8月19日,8月18日,8月17日,8月16日,5,8月13日,8月6日,7月30日,7月23日,8,7,6,5,4,
8月23日,2021,8月20日,8月19日,8月18日,8月17日,1,8月20日,8月13日,8月6日,7月30日,8,7,6,5,4,
8月24日,2021,8月23日,8月20日,8月19日,8月18日,2,8月20日,8月13日,8月6日,7月30日,8,7,6,5,4,
8月25日,2021,8月24日,8月23日,8月20日,8月19日,3,8月20日,8月13日,8月6日,7月30日,8,7,6,5,4,
8月26日,2021,8月25日,8月24日,8月23日,8月20日,4,8月20日,8月13日,8月6日,7月30日,8,7,6,5,4,
8月27日,2021,8月26日,8月25日,8月24日,8月23日,5,8月20日,8月13日,8月6日,7月30日,8,7,6,5,4,
8月30日,2021,8月27日,8月26日,8月25日,8月24日,1,8月27日,8月20日,8月13日,8月6日,8,7,6,5,4,
8月31日,2021,8月30日,8月27日,8月26日,8月25日,2,8月27日,8月20日,8月13日,8月6日,8,7,6,5,4,
9月1日,2021,8月31日,8月30日,8月27日,8月26日,3,8月27日,8月20日,8月13日,8月6日,9,8,7,6,5,
9月2日,2021,9月1日,8月31日,8月30日,8月27日,4,8月27日,8月20日,8月13日,8月6日,9,8,7,6,5,
9月3日,2021,9月2日,9月1日,8月31日,8月30日,5,8月27日,8月20日,8月13日,8月6日,9,8,7,6,5,
9月6日,2021,9月3日,9月2日,9月1日,8月31日,1,9月3日,8月27日,8月20日,8月13日,9,8,7,6,5,
9月7日,2021,9月6日,9月3日,9月2日,9月1日,2,9月3日,8月27日,8月20日,8月13日,9,8,7,6,5,
9月8日,2021,9月7日,9月6日,9月3日,9月2日,3,9月3日,8月27日,8月20日,8月13日,9,8,7,6,5,
9月9日,2021,9月8日,9月7日,9月6日,9月3日,4,9月3日,8月27日,8月20日,8月13日,9,8,7,6,5,
9月10日,2021,9月9日,9月8日,9月7日,9月6日,5,9月3日,8月27日,8月20日,8月13日,9,8,7,6,5,
9月13日,2021,9月10日,9月9日,9月8日,9月7日,1,9月10日,9月3日,8月27日,8月20日,9,8,7,6,5,
9月14日,2021,9月13日,9月10日,9月9日,9月8日,2,9月10日,9月3日,8月27日,8月20日,9,8,7,6,5,
9月15日,2021,9月14日,9月13日,9月10日,9月9日,3,9月10日,9月3日,8月27日,8月20日,9,8,7,6,5,
9月16日,2021,9月15日,9月14日,9月13日,9月10日,4,9月10日,9月3日,8月27日,8月20日,9,8,7,6,5,
9月17日,2021,9月16日,9月15日,9月14日,9月13日,5,9月10日,9月3日,8月27日,8月20日,9,8,7,6,5,
9月20日,2021,9月17日,9月16日,9月15日,9月14日,1,9月17日,9月10日,9月3日,8月27日,9,8,7,6,5,中秋节
9月21日,2021,9月20日,9月17日,9月16日,9月15日,2,9月17日,9月10日,9月3日,8月27日,9,8,7,6,5,中秋节
9月22日,2021,9月21日,9月20日,9月17日,9月16日,3,9月17日,9月10日,9月3日,8月27日,9,8,7,6,5,
9月23日,2021,9月22日,9月21日,9月20日,9月17日,4,9月17日,9月10日,9月3日,8月27日,9,8,7,6,5,
9月24日,2021,9月23日,9月22日,9月21日,9月20日,5,9月17日,9月10日,9月3日,8月27日,9,8,7,6,5,
9月27日,2021,9月24日,9月23日,9月22日,9月21日,1,9月24日,9月17日,9月10日,9月3日,9,8,7,6,5,
9月28日,2021,9月27日,9月24日,9月23日,9月22日,2,9月24日,9月17日,9月10日,9月3日,9,8,7,6,5,
9月29日,2021,9月28日,9月27日,9月24日,9月23日,3,9月24日,9月17日,9月10日,9月3日,9,8,7,6,5,
9月30日,2021,9月29日,9月28日,9月27日,9月24日,4,9月24日,9月17日,9月10日,9月3日,9,8,7,6,5,
10月1日,2021,9月30日,9月29日,9月28日,9月27日,5,9月24日,9月17日,9月10日,9月3日,10,9,8,7,6,国庆节
10月4日,2021,10月1日,9月30日,9月29日,9月28日,1,10月1日,9月24日,9月17日,9月10日,10,9,8,7,6,国庆节
10月5日,2021,10月4日,10月1日,9月30日,9月29日,2,10月1日,9月24日,9月17日,9月10日,10,9,8,7,6,国庆节
10月6日,2021,10月5日,10月4日,10月1日,9月30日,3,10月1日,9月24日,9月17日,9月10日,10,9,8,7,6,国庆节
10月7日,2021,10月6日,10月5日,10月4日,10月1日,4,10月1日,9月24日,9月17日,9月10日,10,9,8,7,6,国庆节
10月8日,2021,10月7日,10月6日,10月5日,10月4日,5,10月1日,9月24日,9月17日,9月10日,10,9,8,7,6,
10月11日,2021,10月8日,10月7日,10月6日,10月5日,1,10月8日,10月1日,9月24日,9月17日,10,9,8,7,6,
10月12日,2021,10月11日,10月8日,10月7日,10月6日,2,10月8日,10月1日,9月24日,9月17日,10,9,8,7,6,
10月13日,2021,10月12日,10月11日,10月8日,10月7日,3,10月8日,10月1日,9月24日,9月17日,10,9,8,7,6,
10月14日,2021,10月13日,10月12日,10月11日,10月8日,4,10月8日,10月1日,9月24日,9月17日,10,9,8,7,6,
10月15日,2021,10月14日,10月13日,10月12日,10月11日,5,10月8日,10月1日,9月24日,9月17日,10,9,8,7,6,
10月18日,2021,10月15日,10月14日,10月13日,10月12日,1,10月15日,10月8日,10月1日,9月24日,10,9,8,7,6,
10月19日,2021,10月18日,10月15日,10月14日,10月13日,2,10月15日,10月8日,10月1日,9月24日,10,9,8,7,6,
10月20日,2021,10月19日,10月18日,10月15日,10月14日,3,10月15日,10月8日,10月1日,9月24日,10,9,8,7,6,
10月21日,2021,10月20日,10月19日,10月18日,10月15日,4,10月15日,10月8日,10月1日,9月24日,10,9,8,7,6,
10月22日,2021,10月21日,10月20日,10月19日,10月18日,5,10月15日,10月8日,10月1日,9月24日,10,9,8,7,6,
10月25日,2021,10月22日,10月21日,10月20日,10月19日,1,10月22日,10月15日,10月8日,10月1日,10,9,8,7,6,
10月26日,2021,10月25日,10月22日,10月21日,10月20日,2,10月22日,10月15日,10月8日,10月1日,10,9,8,7,6,
10月27日,2021,10月26日,10月25日,10月22日,10月21日,3,10月22日,10月15日,10月8日,10月1日,10,9,8,7,6,
10月28日,2021,10月27日,10月26日,10月25日,10月22日,4,10月22日,10月15日,10月8日,10月1日,10,9,8,7,6,
10月29日,2021,10月28日,10月27日,10月26日,10月25日,5,10月22日,10月15日,10月8日,10月1日,10,9,8,7,6,
11月1日,2021,10月29日,10月28日,10月27日,10月26日,1,10月29日,10月22日,10月15日,10月8日,11,10,9,8,7,
11月2日,2021,11月1日,10月29日,10月28日,10月27日,2,10月29日,10月22日,10月15日,10月8日,11,10,9,8,7,
11月3日,2021,11月2日,11月1日,10月29日,10月28日,3,10月29日,10月22日,10月15日,10月8日,11,10,9,8,7,
11月4日,2021,11月3日,11月2日,11月1日,10月29日,4,10月29日,10月22日,10月15日,10月8日,11,10,9,8,7,
11月5日,2021,11月4日,11月3日,11月2日,11月1日,5,10月29日,10月22日,10月15日,10月8日,11,10,9,8,7,
11月8日,2021,11月5日,11月4日,11月3日,11月2日,1,11月5日,10月29日,10月22日,10月15日,11,10,9,8,7,
11月9日,2021,11月8日,11月5日,11月4日,11月3日,2,11月5日,10月29日,10月22日,10月15日,11,10,9,8,7,
11月10日,2021,11月9日,11月8日,11月5日,11月4日,3,11月5日,10月29日,10月22日,10月15日,11,10,9,8,7,
11月11日,2021,11月10日,11月9日,11月8日,11月5日,4,11月5日,10月29日,10月22日,10月15日,11,10,9,8,7,
11月12日,2021,11月11日,11月10日,11月9日,11月8日,5,11月5日,10月29日,10月22日,10月15日,11,10,9,8,7,
11月15日,2021,11月12日,11月11日,11月10日,11月9日,1,11月12日,11月5日,10月29日,10月22日,11,10,9,8,7,
11月16日,2021,11月15日,11月12日,11月11日,11月10日,2,11月12日,11月5日,10月29日,10月22日,11,10,9,8,7,
11月17日,2021,11月16日,11月15日,11月12日,11月11日,3,11月12日,11月5日,10月29日,10月22日,11,10,9,8,7,
11月18日,2021,11月17日,11月16日,11月15日,11月12日,4,11月12日,11月5日,10月29日,10月22日,11,10,9,8,7,
11月19日,2021,11月18日,11月17日,11月16日,11月15日,5,11月12日,11月5日,10月29日,10月22日,11,10,9,8,7,
11月22日,2021,11月19日,11月18日,11月17日,11月16日,1,11月19日,11月12日,11月5日,10月29日,11,10,9,8,7,
11月23日,2021,11月22日,11月19日,11月18日,11月17日,2,11月19日,11月12日,11月5日,10月29日,11,10,9,8,7,
11月24日,2021,11月23日,11月22日,11月19日,11月18日,3,11月19日,11月12日,11月5日,10月29日,11,10,9,8,7,
11月25日,2021,11月24日,11月23日,11月22日,11月19日,4,11月19日,11月12日,11月5日,10月29日,11,10,9,8,7,
11月26日,2021,11月25日,11月24日,11月23日,11月22日,5,11月19日,11月12日,11月5日,10月29日,11,10,9,8,7,
11月29日,2021,11月26日,11月25日,11月24日,11月23日,1,11月26日,11月19日,11月12日,11月5日,11,10,9,8,7,
11月30日,2021,11月29日,11月26日,11月25日,11月24日,2,11月26日,11月19日,11月12日,11月5日,11,10,9,8,7,
12月1日,2021,11月30日,11月29日,11月26日,11月25日,3,11月26日,11月19日,11月12日,11月5日,12,11,10,9,8,
12月2日,2021,12月1日,11月30日,11月29日,11月26日,4,11月26日,11月19日,11月12日,11月5日,12,11,10,9,8,
12月3日,2021,12月2日,12月1日,11月30日,11月29日,5,11月26日,11月19日,11月12日,11月5日,12,11,10,9,8,
12月6日,2021,12月3日,12月2日,12月1日,11月30日,1,12月3日,11月26日,11月19日,11月12日,12,11,10,9,8,
12月7日,2021,12月6日,12月3日,12月2日,12月1日,2,12月3日,11月26日,11月19日,11月12日,12,11,10,9,8,
12月8日,2021,12月7日,12月6日,12月3日,12月2日,3,12月3日,11月26日,11月19日,11月12日,12,11,10,9,8,
12月9日,2021,12月8日,12月7日,12月6日,12月3日,4,12月3日,11月26日,11月19日,11月12日,12,11,10,9,8,
12月10日,2021,12月9日,12月8日,12月7日,12月6日,5,12月3日,11月26日,11月19日,11月12日,12,11,10,9,8,
12月13日,2021,12月10日,12月9日,12月8日,12月7日,1,12月10日,12月3日,11月26日,11月19日,12,11,10,9,8,
12月14日,2021,12月13日,12月10日,12月9日,12月8日,2,12月10日,12月3日,11月26日,11月19日,12,11,10,9,8,
12月15日,2021,12月14日,12月13日,12月10日,12月9日,3,12月10日,12月3日,11月26日,11月19日,12,11,10,9,8,
12月16日,2021,12月15日,12月14日,12月13日,12月10日,4,12月10日,12月3日,11月26日,11月19日,12,11,10,9,8,
12月17日,2021,12月16日,12月15日,12月14日,12月13日,5,12月10日,12月3日,11月26日,11月19日,12,11,10,9,8,
12月20日,2021,12月17日,12月16日,12月15日,12月14日,1,12月17日,12月10日,12月3日,11月26日,12,11,10,9,8,
12月21日,2021,12月20日,12月17日,12月16日,12月15日,2,12月17日,12月10日,12月3日,11月26日,12,11,10,9,8,
12月22日,2021,12月21日,12月20日,12月17日,12月16日,3,12月17日,12月10日,12月3日,11月26日,12,11,10,9,8,
12月23日,2021,12月22日,12月21日,12月20日,12月17日,4,12月17日,12月10日,12月3日,11月26日,12,11,10,9,8,
12月24日,2021,12月23日,12月22日,12月21日,12月20日,5,12月17日,12月10日,12月3日,11月26日,12,11,10,9,8,
12月27日,2021,12月24日,12月23日,12月22日,12月21日,1,12月24日,12月17日,12月10日,12月3日,12,11,10,9,8,
12月28日,2021,12月27日,12月24日,12月23日,12月22日,2,12月24日,12月17日,12月10日,12月3日,12,11,10,9,8,
12月29日,2021,12月28日,12月27日,12月24日,12月23日,3,12月24日,12月17日,12月10日,12月3日,12,11,10,9,8,
12月30日,2021,12月29日,12月28日,12月27日,12月24日,4,12月24日,12月17日,12月10日,12月3日,12,11,10,9,8,
12月31日,2021,12月30日,12月29日,12月28日,12月27日,5,12月24日,12月17日,12月10日,12月3日,12,11,10,9,8,
1月3日,2022,12月31日,12月30日,12月29日,12月28日,1,12月31日,12月24日,12月17日,12月10日,1,12,11,10,9,元旦
1月4日,2022,1月3日,12月31日,12月30日,12月29日,2,12月31日,12月24日,12月17日,12月10日,1,12,11,10,9,
1月5日,2022,1月4日,1月3日,12月31日,12月30日,3,12月31日,12月24日,12月17日,12月10日,1,12,11,10,9,
1月6日,2022,1月5日,1月4日,1月3日,12月31日,4,12月31日,12月24日,12月17日,12月10日,1,12,11,10,9,
1月7日,2022,1月6日,1月5日,1月4日,1月3日,5,12月31日,12月24日,12月17日,12月10日,1,12,11,10,9,
1月10日,2022,1月7日,1月6日,1月5日,1月4日,1,1月7日,12月31日,12月24日,12月17日,1,12,11,10,9,
1月11日,2022,1月10日,1月7日,1月6日,1月5日,2,1月7日,12月31日,12月24日,12月17日,1,12,11,10,9,
1月12日,2022,1月11日,1月10日,1月7日,1月6日,3,1月7日,12月31日,12月24日,12月17日,1,12,11,10,9,
1月13日,2022,1月12日,1月11日,1月10日,1月7日,4,1月7日,12月31日,12月24日,12月17日,1,12,11,10,9,
1月14日,2022,1月13日,1月12日,1月11日,1月10日,5,1月7日,12月31日,12月24日,12月17日,1,12,11,10,9,
1月17日,2022,1月14日,1月13日,1月12日,1月11日,1,1月14日,1月7日,12月31日,12月24日,1,12,11,10,9,
1月18日,2022,1月17日,1月14日,1月13日,1月12日,2,1月14日,1月7日,12月31日,12月24日,1,12,11,10,9,
1月19日,2022,1月18日,1月17日,1月14日,1月13日,3,1月14日,1月7日,12月31日,12月24日,1,12,11,10,9,
1月20日,2022,1月19日,1月18日,1月17日,1月14日,4,1月14日,1月7日,12月31日,12月24日,1,12,11,10,9,
1月21日,2022,1月20日,1月19日,1月18日,1月17日,5,1月14日,1月7日,12月31日,12月24日,1,12,11,10,9,
1月24日,2022,1月21日,1月20日,1月19日,1月18日,1,1月21日,1月14日,1月7日,12月31日,1,12,11,10,9,
1月25日,2022,1月24日,1月21日,1月20日,1月19日,2,1月21日,1月14日,1月7日,12月31日,1,12,11,10,9,
1月26日,2022,1月25日,1月24日,1月21日,1月20日,3,1月21日,1月14日,1月7日,12月31日,1,12,11,10,9,
1月27日,2022,1月26日,1月25日,1月24日,1月21日,4,1月21日,1月14日,1月7日,12月31日,1,12,11,10,9,
1月28日,2022,1月27日,1月26日,1月25日,1月24日,5,1月21日,1月14日,1月7日,12月31日,1,12,11,10,9,
1月31日,2022,1月28日,1月27日,1月26日,1月25日,1,1月28日,1月21日,1月14日,1月7日,1,12,11,10,9,春节
2月1日,2022,1月31日,1月28日,1月27日,1月26日,2,1月28日,1月21日,1月14日,1月7日,2,1,12,11,10,春节
2月2日,2022,2月1日,1月31日,1月28日,1月27日,3,1月28日,1月21日,1月14日,1月7日,2,1,12,11,10,春节
2月3日,2022,2月2日,2月1日,1月31日,1月28日,4,1月28日,1月21日,1月14日,1月7日,2,1,12,11,10,春节
2月4日,2022,2月3日,2月2日,2月1日,1月31日,5,1月28日,1月21日,1月14日,1月7日,2,1,12,11,10,春节
2月7日,2022,2月4日,2月3日,2月2日,2月1日,1,2月4日,1月28日,1月21日,1月14日,2,1,12,11,10,
2月8日,2022,2月7日,2月4日,2月3日,2月2日,2,2月4日,1月28日,1月21日,1月14日,2,1,12,11,10,
2月9日,2022,2月8日,2月7日,2月4日,2月3日,3,2月4日,1月28日,1月21日,1月14日,2,1,12,11,10,
2月10日,2022,2月9日,2月8日,2月7日,2月4日,4,2月4日,1月28日,1月21日,1月14日,2,1,12,11,10,
2月11日,2022,2月10日,2月9日,2月8日,2月7日,5,2月4日,1月28日,1月21日,1月14日,2,1,12,11,10,
2月14日,2022,2月11日,2月10日,2月9日,2月8日,1,2月11日,2月4日,1月28日,1月21日,2,1,12,11,10,
2月15日,2022,2月14日,2月11日,2月10日,2月9日,2,2月11日,2月4日,1月28日,1月21日,2,1,12,11,10,
2月16日,2022,2月15日,2月14日,2月11日,2月10日,3,2月11日,2月4日,1月28日,1月21日,2,1,12,11,10,
2月17日,2022,2月16日,2月15日,2月14日,2月11日,4,2月11日,2月4日,1月28日,1月21日,2,1,12,11,10,
2月18日,2022,2月17日,2月16日,2月15日,2月14日,5,2月11日,2月4日,1月28日,1月21日,2,1,12,11,10,
2月21日,2022,2月18日,2月17日,2月16日,2月15日,1,2月18日,2月11日,2月4日,1月28日,2,1,12,11,10,
2月22日,2022,2月21日,2月18日,2月17日,2月16日,2,2月18日,2月11日,2月4日,1月28日,2,1,12,11,10,
2月23日,2022,2月22日,2月21日,2月18日,2月17日,3,2月18日,2月11日,2月4日,1月28日,2,1,12,11,10,
2月24日,2022,2月23日,2月22日,2月21日,2月18日,4,2月18日,2月11日,2月4日,1月28日,2,1,12,11,10,
2月25日,2022,2月24日,2月23日,2月22日,2月21日,5,2月18日,2月11日,2月4日,1月28日,2,1,12,11,10,
2月28日,2022,2月25日,2月24日,2月23日,2月22日,1,2月25日,2月18日,2月11日,2月4日,2,1,12,11,10,
3月1日,2022,2月28日,2月25日,2月24日,2月23日,2,2月25日,2月18日,2月11日,2月4日,3,2,1,12,11,
3月2日,2022,3月1日,2月28日,2月25日,2月24日,3,2月25日,2月18日,2月11日,2月4日,3,2,1,12,11,
3月3日,2022,3月2日,3月1日,2月28日,2月25日,4,2月25日,2月18日,2月11日,2月4日,3,2,1,12,11,
3月4日,2022,3月3日,3月2日,3月1日,2月28日,5,2月25日,2月18日,2月11日,2月4日,3,2,1,12,11,
3月7日,2022,3月4日,3月3日,3月2日,3月1日,1,3月4日,2月25日,2月18日,2月11日,3,2,1,12,11,
3月8日,2022,3月7日,3月4日,3月3日,3月2日,2,3月4日,2月25日,2月18日,2月11日,3,2,1,12,11,
3月9日,2022,3月8日,3月7日,3月4日,3月3日,3,3月4日,2月25日,2月18日,2月11日,3,2,1,12,11,
3月10日,2022,3月9日,3月8日,3月7日,3月4日,4,3月4日,2月25日,2月18日,2月11日,3,2,1,12,11,
3月11日,2022,3月10日,3月9日,3月8日,3月7日,5,3月4日,2月25日,2月18日,2月11日,3,2,1,12,11,
3月14日,2022,3月11日,3月10日,3月9日,3月8日,1,3月11日,3月4日,2月25日,2月18日,3,2,1,12,11,
3月15日,2022,3月14日,3月11日,3月10日,3月9日,2,3月11日,3月4日,2月25日,2月18日,3,2,1,12,11,
3月16日,2022,3月15日,3月14日,3月11日,3月10日,3,3月11日,3月4日,2月25日,2月18日,3,2,1,12,11,
3月17日,2022,3月16日,3月15日,3月14日,3月11日,4,3月11日,3月4日,2月25日,2月18日,3,2,1,12,11,
3月18日,2022,3月17日,3月16日,3月15日,3月14日,5,3月11日,3月4日,2月25日,2月18日,3,2,1,12,11,
3月21日,2022,3月18日,3月17日,3月16日,3月15日,1,3月18日,3月11日,3月4日,2月25日,3,2,1,12,11,
3月22日,2022,3月21日,3月18日,3月17日,3月16日,2,3月18日,3月11日,3月4日,2月25日,3,2,1,12,11,
3月23日,2022,3月22日,3月21日,3月18日,3月17日,3,3月18日,3月11日,3月4日,2月25日,3,2,1,12,11,
3月24日,2022,3月23日,3月22日,3月21日,3月18日,4,3月18日,3月11日,3月4日,2月25日,3,2,1,12,11,
3月25日,2022,3月24日,3月23日,3月22日,3月21日,5,3月18日,3月11日,3月4日,2月25日,3,2,1,12,11,
3月28日,2022,3月25日,3月24日,3月23日,3月22日,1,3月25日,3月18日,3月11日,3月4日,3,2,1,12,11,
3月29日,2022,3月28日,3月25日,3月24日,3月23日,2,3月25日,3月18日,3月11日,3月4日,3,2,1,12,11,
3月30日,2022,3月29日,3月28日,3月25日,3月24日,3,3月25日,3月18日,3月11日,3月4日,3,2,1,12,11,
3月31日,2022,3月30日,3月29日,3月28日,3月25日,4,3月25日,3月18日,3月11日,3月4日,3,2,1,12,11,
4月1日,2022,3月31日,3月30日,3月29日,3月28日,5,3月25日,3月18日,3月11日,3月4日,4,3,2,1,12,
4月4日,2022,4月1日,3月31日,3月30日,3月29日,1,4月1日,3月25日,3月18日,3月11日,4,3,2,1,12,清明节
4月5日,2022,4月4日,4月1日,3月31日,3月30日,2,4月1日,3月25日,3月18日,3月11日,4,3,2,1,12,清明节
4月6日,2022,4月5日,4月4日,4月1日,3月31日,3,4月1日,3月25日,3月18日,3月11日,4,3,2,1,12,
4月7日,2022,4月6日,4月5日,4月4日,4月1日,4,4月1日,3月25日,3月18日,3月11日,4,3,2,1,12,
4月8日,2022,4月7日,4月6日,4月5日,4月4日,5,4月1日,3月25日,3月18日,3月11日,4,3,2,1,12,
4月11日,2022,4月8日,4月7日,4月6日,4月5日,1,4月8日,4月1日,3月25日,3月18日,4,3,2,1,12,
4月12日,2022,4月11日,4月8日,4月7日,4月6日,2,4月8日,4月1日,3月25日,3月18日,4,3,2,1,12,
4月13日,2022,4月12日,4月11日,4月8日,4月7日,3,4月8日,4月1日,3月25日,3月18日,4,3,2,1,12,
4月14日,2022,4月13日,4月12日,4月11日,4月8日,4,4月8日,4月1日,3月25日,3月18日,4,3,2,1,12,
4月15日,2022,4月14日,4月13日,4月12日,4月11日,5,4月8日,4月1日,3月25日,3月18日,4,3,2,1,12,
4月18日,2022,4月15日,4月14日,4月13日,4月12日,1,4月15日,4月8日,4月1日,3月25日,4,3,2,1,12,
4月19日,2022,4月18日,4月15日,4月14日,4月13日,2,4月15日,4月8日,4月1日,3月25日,4,3,2,1,12,
4月20日,2022,4月19日,4月18日,4月15日,4月14日,3,4月15日,4月8日,4月1日,3月25日,4,3,2,1,12,
4月21日,2022,4月20日,4月19日,4月18日,4月15日,4,4月15日,4月8日,4月1日,3月25日,4,3,2,1,12,
4月22日,2022,4月21日,4月20日,4月19日,4月18日,5,4月15日,4月8日,4月1日,3月25日,4,3,2,1,12,
4月25日,2022,4月22日,4月21日,4月20日,4月19日,1,4月22日,4月15日,4月8日,4月1日,4,3,2,1,12,
4月26日,2022,4月25日,4月22日,4月21日,4月20日,2,4月22日,4月15日,4月8日,4月1日,4,3,2,1,12,
4月27日,2022,4月26日,4月25日,4月22日,4月21日,3,4月22日,4月15日,4月8日,4月1日,4,3,2,1,12,
4月28日,2022,4月27日,4月26日,4月25日,4月22日,4,4月22日,4月15日,4月8日,4月1日,4,3,2,1,12,
4月29日,2022,4月28日,4月27日,4月26日,4月25日,5,4月22日,4月15日,4月8日,4月1日,4,3,2,1,12,
5月2日,2022,4月29日,4月28日,4月27日,4月26日,1,4月29日,4月22日,4月15日,4月8日,5,4,3,2,1,劳动节
5月3日,2022,5月2日,4月29日,4月28日,4月27日,2,4月29日,4月22日,4月15日,4月8日,5,4,3,2,1,劳动节
5月4日,2022,5月3日,5月2日,4月29日,4月28日,3,4月29日,4月22日,4月15日,4月8日,5,4,3,2,1,劳动节
5月5日,2022,5月4日,5月3日,5月2日,4月29日,4,4月29日,4月22日,4月15日,4月8日,5,4,3,2,1,
5月6日,2022,5月5日,5月4日,5月3日,5月2日,5,4月29日,4月22日,4月15日,4月8日,5,4,3,2,1,
5月9日,2022,5月6日,5月5日,5月4日,5月3日,1,5月6日,4月29日,4月22日,4月15日,5,4,3,2,1,
5月10日,2022,5月9日,5月6日,5月5日,5月4日,2,5月6日,4月29日,4月22日,4月15日,5,4,3,2,1,
5月11日,2022,5月10日,5月9日,5月6日,5月5日,3,5月6日,4月29日,4月22日,4月15日,5,4,3,2,1,
5月12日,2022,5月11日,5月10日,5月9日,5月6日,4,5月6日,4月29日,4月22日,4月15日,5,4,3,2,1,
5月13日,2022,5月12日,5月11日,5月10日,5月9日,5,5月6日,4月29日,4月22日,4月15日,5,4,3,2,1,
5月16日,2022,5月13日,5月12日,5月11日,5月10日,1,5月13日,5月6日,4月29日,4月22日,5,4,3,2,1,
5月17日,2022,5月16日,5月13日,5月12日,5月11日,2,5月13日,5月6日,4月29日,4月22日,5,4,3,2,1,
5月18日,2022,5月17日,5月16日,5月13日,5月12日,3,5月13日,5月6日,4月29日,4月22日,5,4,3,2,1,
5月19日,2022,5月18日,5月17日,5月16日,5月13日,4,5月13日,5月6日,4月29日,4月22日,5,4,3,2,1,
5月20日,2022,5月19日,5月18日,5月17日,5月16日,5,5月13日,5月6日,4月29日,4月22日,5,4,3,2,1,
5月23日,2022,5月20日,5月19日,5月18日,5月17日,1,5月20日,5月13日,5月6日,4月29日,5,4,3,2,1,
5月24日,2022,5月23日,5月20日,5月19日,5月18日,2,5月20日,5月13日,5月6日,4月29日,5,4,3,2,1,
5月25日,2022,5月24日,5月23日,5月20日,5月19日,3,5月20日,5月13日,5月6日,4月29日,5,4,3,2,1,
5月26日,2022,5月25日,5月24日,5月23日,5月20日,4,5月20日,5月13日,5月6日,4月29日,5,4,3,2,1,
5月27日,2022,5月26日,5月25日,5月24日,5月23日,5,5月20日,5月13日,5月6日,4月29日,5,4,3,2,1,
5月30日,2022,5月27日,5月26日,5月25日,5月24日,1,5月27日,5月20日,5月13日,5月6日,5,4,3,2,1,
5月31日,2022,5月30日,5月27日,5月26日,5月25日,2,5月27日,5月20日,5月13日,5月6日,5,4,3,2,1,
6月1日,2022,5月31日,5月30日,5月27日,5月26日,3,5月27日,5月20日,5月13日,5月6日,6,5,4,3,2,
6月2日,2022,6月1日,5月31日,5月30日,5月27日,4,5月27日,5月20日,5月13日,5月6日,6,5,4,3,2,
6月3日,2022,6月2日,6月1日,5月31日,5月30日,5,5月27日,5月20日,5月13日,5月6日,6,5,4,3,2,端午节
6月6日,2022,6月3日,6月2日,6月1日,5月31日,1,6月3日,5月27日,5月20日,5月13日,6,5,4,3,2,
6月7日,2022,6月6日,6月3日,6月2日,6月1日,2,6月3日,5月27日,5月20日,5月13日,6,5,4,3,2,
6月8日,2022,6月7日,6月6日,6月3日,6月2日,3,6月3日,5月27日,5月20日,5月13日,6,5,4,3,2,
6月9日,2022,6月8日,6月7日,6月6日,6月3日,4,6月3日,5月27日,5月20日,5月13日,6,5,4,3,2,
6月10日,2022,6月9日,6月8日,6月7日,6月6日,5,6月3日,5月27日,5月20日,5月13日,6,5,4,3,2,
6月13日,2022,6月10日,6月9日,6月8日,6月7日,1,6月10日,6月3日,5月27日,5月20日,6,5,4,3,2,
6月14日,2022,6月13日,6月10日,6月9日,6月8日,2,6月10日,6月3日,5月27日,5月20日,6,5,4,3,2,
6月15日,2022,6月14日,6月13日,6月10日,6月9日,3,6月10日,6月3日,5月27日,5月20日,6,5,4,3,2,
6月16日,2022,6月15日,6月14日,6月13日,6月10日,4,6月10日,6月3日,5月27日,5月20日,6,5,4,3,2,
6月17日,2022,6月16日,6月15日,6月14日,6月13日,5,6月10日,6月3日,5月27日,5月20日,6,5,4,3,2,
6月20日,2022,6月17日,6月16日,6月15日,6月14日,1,6月17日,6月10日,6月3日,5月27日,6,5,4,3,2,
6月21日,2022,6月20日,6月17日,6月16日,6月15日,2,6月17日,6月10日,6月3日,5月27日,6,5,4,3,2,
6月22日,2022,6月21日,6月20日,6月17日,6月16日,3,6月17日,6月10日,6月3日,5月27日,6,5,4,3,2,
6月23日,2022,6月22日,6月21日,6月20日,6月17日,4,6月17日,6月10日,6月3日,5月27日,6,5,4,3,2,
6月24日,2022,6月23日,6月22日,6月21日,6月20日,5,6月17日,6月10日,6月3日,5月27日,6,5,4,3,2,
6月27日,2022,6月24日,6月23日,6月22日,6月21日,1,6月24日,6月17日,6月10日,6月3日,6,5,4,3,2,
6月28日,2022,6月27日,6月24日,6月23日,6月22日,2,6月24日,6月17日,6月10日,6月3日,6,5,4,3,2,
6月29日,2022,6月28日,6月27日,6月24日,6月23日,3,6月24日,6月17日,6月10日,6月3日,6,5,4,3,2,
6月30日,2022,6月29日,6月28日,6月27日,6月24日,4,6月24日,6月17日,6月10日,6月3日,6,5,4,3,2,
7月1日,2022,6月30日,6月29日,6月28日,6月27日,5,6月24日,6月17日,6月10日,6月3日,7,6,5,4,3,
`;