window.onload = function() {
    getAgent();
    setElems();
    setAgent();
    setInner();
}

var config = {
    name: "nexu",
    minWidth: "24%",
    button: [ 
    { idx:0, color: 'indigo', act: 'NA', nexu: '查看主页', org: [], tgt: []},
    { idx:1, color: 'green', act: 'NA', nexu: '发消息', org: [], tgt: [] },
    { idx:2, color: 'green', act: 'NA', nexu: '添加喜欢', org: [], tgt: [] },
    { idx:3, color: 'green', act: '来自', nexu: '解除屏蔽', org: [4], tgt: [6] },
    { idx:4, color: 'green', act: '来自', nexu: '解除拉黑', org: [5], tgt: [6] },
    { idx:5, color: 'green', act: '已', nexu: '添加关注', org: [1, 3, 4, 5], tgt: [0, 2, 2, 2] },
    { idx:6, color: 'red', act: '已', nexu: '屏蔽', org: [3, 4, 5], tgt: [4, 4, 4] },
    { idx:7, color: 'red', act: '已', nexu: '拉黑', org: [3, 4, 5], tgt: [7, 7, 7]  },
    { idx:8, color: 'red', act: '来自', nexu: '取消关注', org: [0, 2], tgt: [5, 5]  },
    ],
    desc: `<h3>众鑫淘金</h3>
    众鑫淘金是一个高效便捷的推广投放平台，
    又是一个安全且稳定的金融理财平台。
    赞助商投放推广红包供淘金者抢夺，
    淘金者可选择投入资金获取收益，
    或者借出本金获得利息，
    也可以选择借入本金来投入。</br>
    众鑫淘金旨在为赞助商提供全方位的推广投放策略，
    为淘金者提供多方面的收益获取方式，
    并建立两者之间的精准对接，进一步打造金融理财新体系和推广投放新模式。`,
};

var items = [
{ idx: '一', title: '我关注的', colorIdx: 1,
btype: 'primary', nexu: '已关注', button: [1, 8, 0],

list: [
{title: '1.1 赞助商', vice: '我关注的赞助商',
lines: [
{uid: '110001', name: '苹果Apple', ladd: 18, tag: ['手机', '电脑', '手表'], mark: ['500强', '科技公司']},
{uid: '110002', name: '腾讯Tencent', ladd: 20, tag: ['英雄联盟', '王者荣耀', '地下城与勇士'], mark: ['500强', '游戏公司']},
{uid: '110002', name: '阿里巴巴Alibaba', ladd: 20, tag: ['支付宝', '淘宝', '1688'], mark: ['500强', '服务公司']},
{uid: '110004', name: '山东蓝翔职业技术学院', ladd: 20, tag: ['挖掘机', '技术', '哪家强'], mark: ['技术培训', '技术学院']},
{uid: '110005', name: '洛丽塔有限公司', ladd: 17, tag: ['处女座', '完美主义者', '被害妄想症'], mark: ['二次元', '中二病']},
{uid: '110006', name: '朝鲜金氏家族', ladd: 15, tag: ['金日成', '金正日', '金正恩'], mark: ['地表最强家族', '北朝鲜霸主']},
]},

{title: '1.2 淘金者', vice:'我关注的淘金者',
lines: [
{uid: '120001', name: '王思聪', ladd: 18, tag: ['你好', '我叫', '王思聪'], mark: ['商业巨子', '装逼之王']},
{uid: '120002', name: '周杰伦', ladd: 16, tag: ['哎呦', '不错', '这个屌'], mark: ['亚洲天王', '无与伦比']},
{uid: '120003', name: '蔡徐坤', ladd: 15, tag: ['SING', 'DANCE', 'RAP'], mark: ['鸡你太美', '狗你太丑']},
{uid: '120004', name: '阿萌蠢又呆', ladd: 8, tag: ['萌', '蠢', '呆'], mark: ['低阶淘金者', '低阶投资者']},
{uid: '120005', name: '冰冷深海鱼', ladd: 13, tag: ['DEEP', 'SEA', 'FISH'], mark: ['低阶淘金者', '低阶投资者']},
{uid: '120006', name: '有雨有雨有雨', ladd: 11, tag: ['有雨', '有雨', '有雨'], mark: ['中阶淘金者', '中阶投资者']},
{uid: '120007', name: 'LOVE芦田爱菜POST', ladd: 15, tag: ['LOVE', '芦田爱菜', 'POST'], mark: ['低阶淘金者', '低阶投资者']},
{uid: '120008', name: '死生契阔', ladd: 14, tag: ['与子成悦', '执子之手', '与子偕老'], mark: ['高阶淘金者', '高阶投资者']},
]},
]},

{ idx: '二', title: '我抢夺的', colorIdx: 2,
btype: 'primary', nexu: '已强制关注', button: [1, 2, 0], 
list: [
{title: '2.1 赞助商', vice:'我抢夺的赞助商',
lines: [
{uid: '210001', name: '三和小炒', ladd: 7, tag: ['快餐', '盒饭', '早饭供应'], mark: ['价格实惠', '好吃不贵']},
{uid: '210002', name: '萌萌水果店', ladd: 9, tag: ['新鲜水果', '送货上门', '水果店'], mark: ['种类丰富', '价格实惠']},
{uid: '210004', name: '宜家家居(上海徐汇店)', ladd: 17, tag: ['上海市', '徐汇区', '漕溪路126号'], mark: ['中阶赞助商', '中阶捐赠者']},
{uid: '210006', name: 'OnitsukaTiger', ladd: 14, tag: ['休闲鞋', '运动鞋', '鬼冢虎'], mark: ['中阶赞助商', '中阶捐赠者']},
{uid: '210005', name: 'Innisfree', ladd: 16, tag: ['化妆品', '悦诗风吟', 'INNISFREE'], mark: ['高阶赞助商', '中阶捐赠者']},
{uid: '210007', name: 'Lilbetter', ladd: 15, tag: ['服装', '服饰', 'LILBETTER'], mark: ['中阶赞助商', '低阶捐赠者']},
{uid: '210009', name: '每日好货', ladd: 16, tag: ['好货推荐', '走过路过', '不要错过'], mark: ['低阶赞助商', '低阶捐赠者']},
]},

{title: '2.2 淘金者', vice:'我抢夺的淘金者',
lines: [
{uid: '220001', name: '张雄壮', ladd: 9, tag: ['富强', '民主', '文明'], mark: ['强我国威', '佑我中华']},
{uid: '220002', name: '王坚强', ladd: 6, tag: ['和谐', '自由', '平等'], mark: ['强我国威', '佑我中华']},
{uid: '220003', name: '李刚猛', ladd: 5, tag: ['公平', '法治', '爱国'], mark: ['强我国威', '佑我中华']},
{uid: '220004', name: '章威武', ladd: 9, tag: ['和谐', '自由', '平等'], mark: ['强我国威', '佑我中华']},
{uid: '220005', name: '马高大', ladd: 7, tag: ['公平', '法治', '爱国'], mark: ['强我国威', '佑我中华']},
{uid: '220006', name: '朱威猛', ladd: 8, tag: ['敬业', '诚信', '友善'], mark: ['强我国威', '佑我中华']},
]},
]},

{ idx: '三', title: '关注我的', colorIdx: 3,
btype: 'default', nexu: '待设置关系', button: [1, 5, 0], 
list: [
{title: '3.1 淘金者', vice:'关注我的淘金者', 
lines: [
{uid: '310001', name: '某新手淘金者', ladd: 3, tag: ['自定义标签1', '自定义标签2', '自定义标签3'], mark: ['成就标签1', '成就标签2']},
{uid: '310002', name: '某低阶淘金者', ladd: 7, tag: ['自定义标签1', '自定义标签2', '自定义标签3'], mark: ['评价展示1', '评价展示2']},
{uid: '310003', name: '某中阶淘金者', ladd: 13, tag: ['自定义标签1', '自定义标签2', '自定义标签3'], mark: ['阶层展示1', '阶层展示2']},
{uid: '310004', name: '某高阶淘金者', ladd: 19, tag: ['自定义标签1', '自定义标签2', '自定义标签3'], mark: ['身份认证1', '身份认证2']},
{uid: '310005', name: '某大师淘金者', ladd: 22, tag: ['自定义标签1', '自定义标签2', '自定义标签3'], mark: ['成就标签1', '成就标签2']},
]},
]},

{ idx: '四', title: '抢夺我的', colorIdx: 4,
btype: 'default', nexu: '待设置关系', button: [1, 5, 0], 
list: [
{title: '4.1 淘金者', vice:'抢夺我的淘金者', 
lines: [
{uid: '410001', name: '三和大神懒羊羊', ladd: 3, tag: ['众筹午饭', '众筹晚饭', '众筹上网费'], mark: ['那是黑厂', '我们去上网']},
{uid: '410002', name: '三和大神美羊羊', ladd: 1, tag: ['清蓝大水', '双丰面馆', '海信大酒店'], mark: ['低阶淘金者', '低阶投资者']},
{uid: '410003', name: '三和大神皮皮虾', ladd: 1, tag: ['团饭', '瘫痪', '挂逼'], mark: ['皮裤万古', '皮裤大帝']},
]},
]},

{ idx: '五', title: '我屏蔽的', colorIdx: 5,
btype: 'warn', nexu: '已屏蔽', button: [3, 0], 
list: [
{title: '5.1 赞助商', vice:'我屏蔽的赞助商',
lines: [
{uid: '510001', name: '明珠家具城(清浅镇东街)', ladd: 16, tag: ['家具', '电器', '清浅镇东街'], mark: ['低阶淘金者', '新手投资者']},
{uid: '510002', name: '手机专卖店(清浅镇西街)', ladd: 16, tag: ['Oppo', 'Vivo', '清浅镇西街'], mark: ['低阶淘金者', '新手投资者']},
{uid: '510003', name: '好又多超市(清浅镇南街)', ladd: 16, tag: ['超市', '大卖场', '清浅镇南街'], mark: ['低阶淘金者', '新手投资者']},
{uid: '510004', name: '新华猪肉铺(清浅镇北街)', ladd: 16, tag: ['猪肉', '排骨', '清浅镇北街'], mark: ['低阶淘金者', '新手投资者']},
]},

{title: '5.2 淘金者', vice:'我屏蔽的淘金者',
lines: [
{uid: '520001', name: '昆山龙哥刘海龙', ladd: 12, tag: ['老铁', '双击', '666'], mark: ['影帝', '逼王']},
{uid: '520002', name: '四川股神巴菲特', ladd: 10, tag: ['割肉', '断腕', '腰斩'], mark: ['老哥带我上岸', '老哥还在吗']},
]},
]},


{ idx: '六', title: '无关系的', colorIdx: 6,
btype: 'default', nexu: '待设置关系', button: [1, 5, 0], 
list:[
{title: '6.1 赞助商', vice:'无关系的赞助商',
lines: [
{uid: '210009', name: '每日好货', ladd: 16, tag: ['好货推荐', '走过路过', '不要错过'], mark: ['低阶赞助商', '低阶捐赠者']},

]},

{title: '6.2 淘金者', vice:'无关系的淘金者',
lines: [
{uid: '120007', name: 'LOVE芦田爱菜POST', ladd: 15, tag: ['LOVE', '芦田爱菜', 'POST'], mark: ['低阶淘金者', '低阶投资者']},
{uid: '120008', name: '死生契阔', ladd: 14, tag: ['与子成悦', '执子之手', '与子偕老'], mark: ['高阶淘金者', '高阶投资者']},
]},
]},
];

var industry = `
01-农,
02-林,
03-畜牧,
04-渔,
05-农、林、牧、渔专业及辅助性活动,
06-煤炭开采和洗选,
07-石油和天然气开采,
08-黑色金属矿采选,
09-有色金属矿采选,
10-非金属矿采选,
11-开采专业及辅助性活动,
12-其他采矿,
13-农副食品加工,
14-食品制造,
15-酒、饮料和精制茶制造,
16-烟草制品,
17-纺织,
18-纺织服装、服饰,
19-皮革、毛皮、羽毛及其制品和制鞋,
20-木材加工和木、竹、藤、棕、草制品,
21-家具制造,
22-造纸和纸制品,
23-印刷和记录媒介复制,
24-文教、工美、体育和娱乐用品制造,
25-石油、煤炭及其他燃料加工,
26-化学原料和化学制品制造,
27-医药制造,
28-化学纤维制造,
29-橡胶和塑料制品,
30-非金属矿物制品,
31-黑色金属冶炼和压延加工业,
32-有色金属冶炼和压延加工,
33-金属制品,
34-通用设备制造,
35-专用设备制造,
36-汽车制造,
37-铁路、船舶、航空航天和其他运输设备制造,
38-电气机械和器材制造,
39-计算机、通信和其他电子设备制造,
40-仪器仪表制造,
41-其他制造,
42-废弃资源综合利用,
43-金属制品、机械和设备修理,
44-电力、热力生产和供应,
45-燃气生产和供应,
46-水的生产和供应,
47-房屋建筑,
48-土木工程建筑,
49-建筑安装,
50-建筑装饰、装修和其他建筑,
51-批发,
52-零售,
53-铁路运输,
54-道路运输,
55-水上运输,
56-航空运输,
57-管道运输,
58-多式联运和运输代理,
59-装卸搬运和仓储,
60-邮政,
61-住宿,
62-餐饮,
63-电信、广播电视和卫星传输服务,
64-互联网和相关服务,
65-软件和信息技术服务,
66-货币金融服务,
67-资本市场服务,
68-保险,
69-其他金融,
70-房地产,
71-租赁,
72-商务服务,
73-研究和试验发展,
74-专业技术服务,
75-科技推广和应用服务,
76-水利管理,
77-生态保护和环境治理,
78-公共设施管理,
79-土地管理,
80-居民服务,
81-机动车、电子产品和日用产品修理,
82-其他服务,
83-教育,
84-卫生,
85-社会工作,
86-新闻和出版,
87-广播、电视、电影和录音制作,
88-文化艺术,
89-体育,
90-娱乐,
91-中国共产党机关,
92-国家机构,
93-人民政协、民主党派,
94-社会保障,
95-群众团体、社会团体和其他成员组织,
96-基层群众自治组织,
97-国际组织
`;

var digger = `
张雄壮,
李刚猛,
王坚强,
赵震撼,
章威武,
`;
